Revit 2024 API
BuiltInFailures.SketchFailures.MutipleStairsPathInOneRunFailure Property
 Each stairs run can only have one stairs path.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId MutipleStairsPathInOneRunFailure { get; }
Visual Basic
Public Shared ReadOnly Property MutipleStairsPathInOneRunFailure As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ MutipleStairsPathInOneRunFailure {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.SketchFailures Class
Autodesk.Revit.DB Namespace